In [10]:
import pandas as pd

In [12]:
df1 = pd.read_excel(r"C:\Users\italo\Desktop\Cursos e Bootcamps\DIO\Bootcamps\Geração Tech Unimed-BH - Ciência de Dados\2. Python para Cientistas de Dados\6. Análise de Dados com Python e Pandas\3. Trabalhando com Planilhas do Excel\datasets\Aracaju.xlsx")
df2 = pd.read_excel(r"C:\Users\italo\Desktop\Cursos e Bootcamps\DIO\Bootcamps\Geração Tech Unimed-BH - Ciência de Dados\2. Python para Cientistas de Dados\6. Análise de Dados com Python e Pandas\3. Trabalhando com Planilhas do Excel\datasets\Fortaleza.xlsx")
df3 = pd.read_excel(r"C:\Users\italo\Desktop\Cursos e Bootcamps\DIO\Bootcamps\Geração Tech Unimed-BH - Ciência de Dados\2. Python para Cientistas de Dados\6. Análise de Dados com Python e Pandas\3. Trabalhando com Planilhas do Excel\datasets\Natal.xlsx")
df4 = pd.read_excel(r"C:\Users\italo\Desktop\Cursos e Bootcamps\DIO\Bootcamps\Geração Tech Unimed-BH - Ciência de Dados\2. Python para Cientistas de Dados\6. Análise de Dados com Python e Pandas\3. Trabalhando com Planilhas do Excel\datasets\Recife.xlsx")
df5 = pd.read_excel(r"C:\Users\italo\Desktop\Cursos e Bootcamps\DIO\Bootcamps\Geração Tech Unimed-BH - Ciência de Dados\2. Python para Cientistas de Dados\6. Análise de Dados com Python e Pandas\3. Trabalhando com Planilhas do Excel\datasets\Salvador.xlsx")

In [13]:
# Juntando todos os arquivos
df = pd.concat([df1, df2, df3, df4, df5])

In [14]:
df1.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [15]:
df2.head()

      Cidade       Data  Vendas  LojaID  Qtde
0  Fortaleza 2019-01-01   45.27    1002     2
1  Fortaleza 2019-01-01  115.61    1002     3
2  Fortaleza 2019-02-10   35.33    1004     3
3  Fortaleza 2019-02-10   20.95    1004     6
4  Fortaleza 2019-01-01   14.25    1004     6

In [16]:
df3.head()

  Cidade       Data  Vendas  LojaID  Qtde
0  Natal 2018-08-27   606.0     853     2
1  Natal 2018-11-25   563.0     853     2
2  Natal 2019-03-11   308.0     852     3
3  Natal 2019-01-07   271.0     854     3
4  Natal 2019-03-09   699.0     853     3

In [17]:
df4.head()

   Cidade       Data  Vendas  LojaID  Qtde
0  Recife 2019-01-01  162.61     981     1
1  Recife 2019-01-01   11.44     983     1
2  Recife 2019-02-10   12.94     983     5
3  Recife 2019-02-10  160.54     981     3
4  Recife 2019-02-14   19.89     983     7

In [18]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [19]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [20]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [21]:
# Retornando uma amostra do conjunto de dados
df.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde
53    Aracaju 2018-01-01    8.64    1522     2
109   Aracaju 2018-01-01   51.64    1523     5
0    Salvador 2018-01-01   31.06    1037     3
77      Natal 2019-04-01  426.00     853     3
167     Natal 2019-01-02   36.42    1037     1

In [23]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [24]:
# Alterando o tipo de dado de cada coluna
df["LojaID"] = df["LojaID"].astype("object")

In [25]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [26]:
# Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [27]:
# Substituindo os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [28]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [29]:
# Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [30]:
# Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [31]:
# Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [32]:
# Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

In [33]:
# Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [34]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [35]:
# Caso eu tivesse Receita e Vendas e não soubesse a quantidade
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [36]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [37]:
# Retornando a maior receita
df["Receita"].max()

3544.0

In [38]:
# Retornando a menor receita
df["Receita"].min()

3.34

In [40]:
# nlargest (maiores com base em algo)
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [41]:
# nsmallest (menores com base em algo)
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [42]:
# Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [45]:
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [46]:
# Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0